markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_adc.h
/**
 * \file
 * <!--
 * This file is part of BeRTOS.
 *
 * Bertos is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 *
 * As a special exception, you may use this file as part of a free software
 * library without restriction.  Specifically, if other files instantiate
 * templates or use macros or inline functions from this file, or you compile
 * this file and link it with other files to produce an executable, this
 * file does not by itself cause the resulting executable to be covered by
 * the GNU General Public License.  This exception does not however
 * invalidate any other reasons why the executable file might be covered by
 * the GNU General Public License.
 *
 * Copyright 2010 Develer S.r.l. (http:///</<www.develer.com/)
 *
 * -->
 *
 * \brief LM3S ADC definition.
 */

#ifndef LM3S_ADC_H
#define LM3S_ADC_H


/*
 * The following are defines for the ADC register offsets.
 */
#define ADC_O_ACTSS             0x00000000  ///< ADC Active Sample Sequencer
#define ADC_O_RIS               0x00000004  ///< ADC Raw Interrupt Status
#define ADC_O_IM                0x00000008  ///< ADC Interrupt Mask
#define ADC_O_ISC               0x0000000C  ///< ADC Interrupt Status and Clear
#define ADC_O_OSTAT             0x00000010  ///< ADC Overflow Status
#define ADC_O_EMUX              0x00000014  ///< ADC Event Multiplexer Select
#define ADC_O_USTAT             0x00000018  ///< ADC Underflow Status
#define ADC_O_SSPRI             0x00000020  ///< ADC Sample Sequencer Priority
#define ADC_O_SPC               0x00000024  ///< ADC Sample Phase Control
#define ADC_O_PSSI              0x00000028  ///< ADC Processor Sample Sequence
                                            ///< Initiate
#define ADC_O_SAC               0x00000030  ///< ADC Sample Averaging Control
#define ADC_O_DCISC             0x00000034  ///< ADC Digital Comparator Interrupt
                                            ///< Status and Clear
#define ADC_O_CTL               0x00000038  ///< ADC Control
#define ADC_O_SSMUX0            0x00000040  ///< ADC Sample Sequence Input
                                            ///< Multiplexer Select 0
#define ADC_O_SSCTL0            0x00000044  ///< ADC Sample Sequence Control 0
#define ADC_O_SSFIFO0           0x00000048  ///< ADC Sample Sequence Result FIFO
                                            ///< 0
#define ADC_O_SSFSTAT0          0x0000004C  ///< ADC Sample Sequence FIFO 0
                                            ///< Status
#define ADC_O_SSOP0             0x00000050  ///< ADC Sample Sequence 0 Operation
#define ADC_O_SSDC0             0x00000054  ///< ADC Sample Sequence 0 Digital
                                            ///< Comparator Select
#define ADC_O_SSMUX1            0x00000060  ///< ADC Sample Sequence Input
                                            ///< Multiplexer Select 1
#define ADC_O_SSCTL1            0x00000064  ///< ADC Sample Sequence Control 1
#define ADC_O_SSFIFO1           0x00000068  ///< ADC Sample Sequence Result FIFO
                                            ///< 1
#define ADC_O_SSFSTAT1          0x0000006C  ///< ADC Sample Sequence FIFO 1
                                            ///< Status
#define ADC_O_SSOP1             0x00000070  ///< ADC Sample Sequence 1 Operation
#define ADC_O_SSDC1             0x00000074  ///< ADC Sample Sequence 1 Digital
                                            ///< Comparator Select
#define ADC_O_SSMUX2            0x00000080  ///< ADC Sample Sequence Input
                                            ///< Multiplexer Select 2
#define ADC_O_SSCTL2            0x00000084  ///< ADC Sample Sequence Control 2
#define ADC_O_SSFIFO2           0x00000088  ///< ADC Sample Sequence Result FIFO
                                            ///< 2
#define ADC_O_SSFSTAT2          0x0000008C  ///< ADC Sample Sequence FIFO 2
                                            ///< Status
#define ADC_O_SSOP2             0x00000090  ///< ADC Sample Sequence 2 Operation
#define ADC_O_SSDC2             0x00000094  ///< ADC Sample Sequence 2 Digital
                                            ///< Comparator Select
#define ADC_O_SSMUX3            0x000000A0  ///< ADC Sample Sequence Input
                                            ///< Multiplexer Select 3
#define ADC_O_SSCTL3            0x000000A4  ///< ADC Sample Sequence Control 3
#define ADC_O_SSFIFO3           0x000000A8  ///< ADC Sample Sequence Result FIFO
                                            ///< 3
#define ADC_O_SSFSTAT3          0x000000AC  ///< ADC Sample Sequence FIFO 3
                                            ///< Status
#define ADC_O_SSOP3             0x000000B0  ///< ADC Sample Sequence 3 Operation
#define ADC_O_SSDC3             0x000000B4  ///< ADC Sample Sequence 3 Digital
                                            ///< Comparator Select
#define ADC_O_TMLB              0x00000100  ///< ADC Test Mode Loopback
#define ADC_O_DCRIC             0x00000D00  ///< ADC Digital Comparator Reset
                                            ///< Initial Conditions
#define ADC_O_DCCTL0            0x00000E00  ///< ADC Digital Comparator Control 0
#define ADC_O_DCCTL1            0x00000E04  ///< ADC Digital Comparator Control 1
#define ADC_O_DCCTL2            0x00000E08  ///< ADC Digital Comparator Control 2
#define ADC_O_DCCTL3            0x00000E0C  ///< ADC Digital Comparator Control 3
#define ADC_O_DCCTL4            0x00000E10  ///< ADC Digital Comparator Control 4
#define ADC_O_DCCTL5            0x00000E14  ///< ADC Digital Comparator Control 5
#define ADC_O_DCCTL6            0x00000E18  ///< ADC Digital Comparator Control 6
#define ADC_O_DCCTL7            0x00000E1C  ///< ADC Digital Comparator Control 7
#define ADC_O_DCCMP0            0x00000E40  ///< ADC Digital Comparator Range 0
#define ADC_O_DCCMP1            0x00000E44  ///< ADC Digital Comparator Range 1
#define ADC_O_DCCMP2            0x00000E48  ///< ADC Digital Comparator Range 2
#define ADC_O_DCCMP3            0x00000E4C  ///< ADC Digital Comparator Range 3
#define ADC_O_DCCMP4            0x00000E50  ///< ADC Digital Comparator Range 4
#define ADC_O_DCCMP5            0x00000E54  ///< ADC Digital Comparator Range 5
#define ADC_O_DCCMP6            0x00000E58  ///< ADC Digital Comparator Range 6
#define ADC_O_DCCMP7            0x00000E5C  ///< ADC Digital Comparator Range 7


