markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_adc.h
/*
 * The following are defines for the bit fields in the ADC_O_ACTSS register.
 */
#define ADC_ACTSS_ASEN3         0x00000008  ///< ADC SS3 Enable
#define ADC_ACTSS_ASEN2         0x00000004  ///< ADC SS2 Enable
#define ADC_ACTSS_ASEN1         0x00000002  ///< ADC SS1 Enable
#define ADC_ACTSS_ASEN0         0x00000001  ///< ADC SS0 Enable


/*
 * The following are defines for the bit fields in the ADC_O_RIS register.
 */
#define ADC_RIS_INRDC           0x00010000  ///< Digital Comparator Raw Interrupt
                                            ///< Status
#define ADC_RIS_INR3            0x00000008  ///< SS3 Raw Interrupt Status
#define ADC_RIS_INR2            0x00000004  ///< SS2 Raw Interrupt Status
#define ADC_RIS_INR1            0x00000002  ///< SS1 Raw Interrupt Status
#define ADC_RIS_INR0            0x00000001  ///< SS0 Raw Interrupt Status


/*
 * The following are defines for the bit fields in the ADC_O_IM register.
 */
#define ADC_IM_DCONSS3          0x00080000  ///< Digital Comparator Interrupt on
                                            ///< SS3
#define ADC_IM_DCONSS2          0x00040000  ///< Digital Comparator Interrupt on
                                            ///< SS2
#define ADC_IM_DCONSS1          0x00020000  ///< Digital Comparator Interrupt on
                                            ///< SS1
#define ADC_IM_DCONSS0          0x00010000  ///< Digital Comparator Interrupt on
                                            ///< SS0
#define ADC_IM_MASK3            0x00000008  ///< SS3 Interrupt Mask
#define ADC_IM_MASK2            0x00000004  ///< SS2 Interrupt Mask
#define ADC_IM_MASK1            0x00000002  ///< SS1 Interrupt Mask
#define ADC_IM_MASK0            0x00000001  ///< SS0 Interrupt Mask


/*
 * The following are defines for the bit fields in the ADC_O_ISC register.
 */
#define ADC_ISC_DCINSS3         0x00080000  ///< Digital Comparator Interrupt
                                            ///< Status on SS3
#define ADC_ISC_DCINSS2         0x00040000  ///< Digital Comparator Interrupt
                                            ///< Status on SS2
#define ADC_ISC_DCINSS1         0x00020000  ///< Digital Comparator Interrupt
                                            ///< Status on SS1
#define ADC_ISC_DCINSS0         0x00010000  ///< Digital Comparator Interrupt
                                            ///< Status on SS0
#define ADC_ISC_IN3             0x00000008  ///< SS3 Interrupt Status and Clear
#define ADC_ISC_IN2             0x00000004  ///< SS2 Interrupt Status and Clear
#define ADC_ISC_IN1             0x00000002  ///< SS1 Interrupt Status and Clear
#define ADC_ISC_IN0             0x00000001  ///< SS0 Interrupt Status and Clear


/*
 * The following are defines for the bit fields in the ADC_O_OSTAT register.
 */
#define ADC_OSTAT_OV3           0x00000008  ///< SS3 FIFO Overflow
#define ADC_OSTAT_OV2           0x00000004  ///< SS2 FIFO Overflow
#define ADC_OSTAT_OV1           0x00000002  ///< SS1 FIFO Overflow
#define ADC_OSTAT_OV0           0x00000001  ///< SS0 FIFO Overflow


/*
 * The following are defines for the bit fields in the ADC_O_EMUX register.
 */
#define ADC_EMUX_EM3_M          0x0000F000  ///< SS3 Trigger Select
#define ADC_EMUX_EM3_PROCESSOR  0x00000000  ///< Processor (default)
#define ADC_EMUX_EM3_COMP0      0x00001000  ///< Analog Comparator 0
#define ADC_EMUX_EM3_COMP1      0x00002000  ///< Analog Comparator 1
#define ADC_EMUX_EM3_COMP2      0x00003000  ///< Analog Comparator 2
#define ADC_EMUX_EM3_EXTERNAL   0x00004000  ///< External (GPIO PB4)
#define ADC_EMUX_EM3_TIMER      0x00005000  ///< Timer
#define ADC_EMUX_EM3_PWM0       0x00006000  ///< PWM0
#define ADC_EMUX_EM3_PWM1       0x00007000  ///< PWM1
#define ADC_EMUX_EM3_PWM2       0x00008000  ///< PWM2
#define ADC_EMUX_EM3_PWM3       0x00009000  ///< PWM3
#define ADC_EMUX_EM3_ALWAYS     0x0000F000  ///< Always (continuously sample)
#define ADC_EMUX_EM2_M          0x00000F00  ///< SS2 Trigger Select
#define ADC_EMUX_EM2_PROCESSOR  0x00000000  ///< Processor (default)
#define ADC_EMUX_EM2_COMP0      0x00000100  ///< Analog Comparator 0
#define ADC_EMUX_EM2_COMP1      0x00000200  ///< Analog Comparator 1
#define ADC_EMUX_EM2_COMP2      0x00000300  ///< Analog Comparator 2
#define ADC_EMUX_EM2_EXTERNAL   0x00000400  ///< External (GPIO PB4)
#define ADC_EMUX_EM2_TIMER      0x00000500  ///< Timer
#define ADC_EMUX_EM2_PWM0       0x00000600  ///< PWM0
#define ADC_EMUX_EM2_PWM1       0x00000700  ///< PWM1
#define ADC_EMUX_EM2_PWM2       0x00000800  ///< PWM2
#define ADC_EMUX_EM2_PWM3       0x00000900  ///< PWM3
#define ADC_EMUX_EM2_ALWAYS     0x00000F00  ///< Always (continuously sample)
#define ADC_EMUX_EM1_M          0x000000F0  ///< SS1 Trigger Select
#define ADC_EMUX_EM1_PROCESSOR  0x00000000  ///< Processor (default)
#define ADC_EMUX_EM1_COMP0      0x00000010  ///< Analog Comparator 0
#define ADC_EMUX_EM1_COMP1      0x00000020  ///< Analog Comparator 1
#define ADC_EMUX_EM1_COMP2      0x00000030  ///< Analog Comparator 2
#define ADC_EMUX_EM1_EXTERNAL   0x00000040  ///< External (GPIO PB4)
#define ADC_EMUX_EM1_TIMER      0x00000050  ///< Timer
#define ADC_EMUX_EM1_PWM0       0x00000060  ///< PWM0
#define ADC_EMUX_EM1_PWM1       0x00000070  ///< PWM1
#define ADC_EMUX_EM1_PWM2       0x00000080  ///< PWM2
#define ADC_EMUX_EM1_PWM3       0x00000090  ///< PWM3
#define ADC_EMUX_EM1_ALWAYS     0x000000F0  ///< Always (continuously sample)
#define ADC_EMUX_EM0_M          0x0000000F  ///< SS0 Trigger Select
#define ADC_EMUX_EM0_PROCESSOR  0x00000000  ///< Processor (default)
#define ADC_EMUX_EM0_COMP0      0x00000001  ///< Analog Comparator 0
#define ADC_EMUX_EM0_COMP1      0x00000002  ///< Analog Comparator 1
#define ADC_EMUX_EM0_COMP2      0x00000003  ///< Analog Comparator 2
#define ADC_EMUX_EM0_EXTERNAL   0x00000004  ///< External (GPIO PB4)
#define ADC_EMUX_EM0_TIMER      0x00000005  ///< Timer
#define ADC_EMUX_EM0_PWM0       0x00000006  ///< PWM0
#define ADC_EMUX_EM0_PWM1       0x00000007  ///< PWM1
#define ADC_EMUX_EM0_PWM2       0x00000008  ///< PWM2
#define ADC_EMUX_EM0_PWM3       0x00000009  ///< PWM3
#define ADC_EMUX_EM0_ALWAYS     0x0000000F  ///< Always (continuously sample)


