markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_adc.h
/*
 * The following are defines for the bit fields in the ADC_O_SSDC2 register.
 */
#define ADC_SSDC2_S3DCSEL_M     0x0000F000  ///< Sample 3 Digital Comparator
                                            ///< Select
#define ADC_SSDC2_S2DCSEL_M     0x00000F00  ///< Sample 2 Digital Comparator
                                            ///< Select
#define ADC_SSDC2_S1DCSEL_M     0x000000F0  ///< Sample 1 Digital Comparator
                                            ///< Select
#define ADC_SSDC2_S0DCSEL_M     0x0000000F  ///< Sample 0 Digital Comparator
                                            ///< Select
#define ADC_SSDC2_S2DCSEL_S     8
#define ADC_SSDC2_S1DCSEL_S     4
#define ADC_SSDC2_S0DCSEL_S     0


/*
 * The following are defines for the bit fields in the ADC_O_SSMUX3 register.
 */
#define ADC_SSMUX3_MUX0_M       0x0000000F  ///< 1st Sample Input Select
#define ADC_SSMUX3_MUX0_S       0


/*
 * The following are defines for the bit fields in the ADC_O_SSCTL3 register.
 */
#define ADC_SSCTL3_TS0          0x00000008  ///< 1st Sample Temp Sensor Select
#define ADC_SSCTL3_IE0          0x00000004  ///< 1st Sample Interrupt Enable
#define ADC_SSCTL3_END0         0x00000002  ///< 1st Sample is End of Sequence
#define ADC_SSCTL3_D0           0x00000001  ///< 1st Sample Diff Input Select


/*
 * The following are defines for the bit fields in the ADC_O_SSFIFO3 register.
 */
#define ADC_SSFIFO3_DATA_M      0x000003FF  ///< Conversion Result Data
#define ADC_SSFIFO3_DATA_S      0


/*
 * The following are defines for the bit fields in the ADC_O_SSFSTAT3 register.
 */
#define ADC_SSFSTAT3_FULL       0x00001000  ///< FIFO Full
#define ADC_SSFSTAT3_EMPTY      0x00000100  ///< FIFO Empty
#define ADC_SSFSTAT3_HPTR_M     0x000000F0  ///< FIFO Head Pointer
#define ADC_SSFSTAT3_TPTR_M     0x0000000F  ///< FIFO Tail Pointer
#define ADC_SSFSTAT3_HPTR_S     4
#define ADC_SSFSTAT3_TPTR_S     0


/*
 * The following are defines for the bit fields in the ADC_O_SSOP3 register.
 */
#define ADC_SSOP3_S0DCOP        0x00000001  ///< Sample 0 Digital Comparator
                                            ///< Operation


/*
 * The following are defines for the bit fields in the ADC_O_SSDC3 register.
 */
#define ADC_SSDC3_S0DCSEL_M     0x0000000F  ///< Sample 0 Digital Comparator
                                            ///< Select


/*
 * The following are defines for the bit fields in the ADC_O_TMLB register.
 */
#define ADC_TMLB_LB             0x00000001  ///< Loopback Mode Enable


/*
 * The following are defines for the bit fields in the ADC_O_DCRIC register.
 */
#define ADC_DCRIC_DCTRIG7       0x00800000  ///< Digital Comparator Trigger 7
#define ADC_DCRIC_DCTRIG6       0x00400000  ///< Digital Comparator Trigger 6
#define ADC_DCRIC_DCTRIG5       0x00200000  ///< Digital Comparator Trigger 5
#define ADC_DCRIC_DCTRIG4       0x00100000  ///< Digital Comparator Trigger 4
#define ADC_DCRIC_DCTRIG3       0x00080000  ///< Digital Comparator Trigger 3
#define ADC_DCRIC_DCTRIG2       0x00040000  ///< Digital Comparator Trigger 2
#define ADC_DCRIC_DCTRIG1       0x00020000  ///< Digital Comparator Trigger 1
#define ADC_DCRIC_DCTRIG0       0x00010000  ///< Digital Comparator Trigger 0
#define ADC_DCRIC_DCINT7        0x00000080  ///< Digital Comparator Interrupt 7
#define ADC_DCRIC_DCINT6        0x00000040  ///< Digital Comparator Interrupt 6
#define ADC_DCRIC_DCINT5        0x00000020  ///< Digital Comparator Interrupt 5
#define ADC_DCRIC_DCINT4        0x00000010  ///< Digital Comparator Interrupt 4
#define ADC_DCRIC_DCINT3        0x00000008  ///< Digital Comparator Interrupt 3
#define ADC_DCRIC_DCINT2        0x00000004  ///< Digital Comparator Interrupt 2
#define ADC_DCRIC_DCINT1        0x00000002  ///< Digital Comparator Interrupt 1
#define ADC_DCRIC_DCINT0        0x00000001  ///< Digital Comparator Interrupt 0


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL0 register.
 */
#define ADC_DCCTL0_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL0_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL0_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL0_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL0_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL0_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL0_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL0_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL0_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL0_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL0_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL0_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL0_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL0_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL0_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL0_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL0_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL0_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL0_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL0_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL1 register.
 */
#define ADC_DCCTL1_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL1_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL1_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL1_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL1_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL1_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL1_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL1_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL1_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL1_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL1_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL1_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL1_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL1_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL1_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL1_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL1_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL1_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL1_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL1_CIM_HONCE    0x00000003  ///< Hysteresis Once


