markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_adc.h
/*
 * The following are defines for the bit fields in the ADC_O_DCCTL2 register.
 */
#define ADC_DCCTL2_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL2_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL2_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL2_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL2_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL2_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL2_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL2_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL2_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL2_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL2_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL2_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL2_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL2_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL2_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL2_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL2_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL2_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL2_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL2_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL3 register.
 */
#define ADC_DCCTL3_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL3_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL3_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL3_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL3_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL3_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL3_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL3_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL3_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL3_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL3_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL3_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL3_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL3_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL3_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL3_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL3_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL3_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL3_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL3_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL4 register.
 */
#define ADC_DCCTL4_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL4_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL4_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL4_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL4_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL4_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL4_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL4_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL4_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL4_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL4_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL4_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL4_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL4_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL4_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL4_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL4_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL4_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL4_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL4_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL5 register.
 */
#define ADC_DCCTL5_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL5_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL5_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL5_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL5_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL5_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL5_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL5_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL5_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL5_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL5_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL5_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL5_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL5_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL5_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL5_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL5_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL5_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL5_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL5_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCTL6 register.
 */
#define ADC_DCCTL6_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL6_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL6_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL6_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL6_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL6_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL6_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL6_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL6_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL6_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL6_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL6_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL6_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL6_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL6_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL6_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL6_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL6_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL6_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL6_CIM_HONCE    0x00000003  ///< Hysteresis Once


