markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_adc.h
/*
 * The following are defines for the bit fields in the ADC_O_DCCTL7 register.
 */
#define ADC_DCCTL7_CTE          0x00001000  ///< Comparison Trigger Enable
#define ADC_DCCTL7_CTC_M        0x00000C00  ///< Comparison Trigger Condition
#define ADC_DCCTL7_CTC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL7_CTC_MID      0x00000400  ///< Mid Band
#define ADC_DCCTL7_CTC_HIGH     0x00000C00  ///< High Band
#define ADC_DCCTL7_CTM_M        0x00000300  ///< Comparison Trigger Mode
#define ADC_DCCTL7_CTM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL7_CTM_ONCE     0x00000100  ///< Once
#define ADC_DCCTL7_CTM_HALWAYS  0x00000200  ///< Hysteresis Always
#define ADC_DCCTL7_CTM_HONCE    0x00000300  ///< Hysteresis Once
#define ADC_DCCTL7_CIE          0x00000010  ///< Comparison Interrupt Enable
#define ADC_DCCTL7_CIC_M        0x0000000C  ///< Comparison Interrupt Condition
#define ADC_DCCTL7_CIC_LOW      0x00000000  ///< Low Band
#define ADC_DCCTL7_CIC_MID      0x00000004  ///< Mid Band
#define ADC_DCCTL7_CIC_HIGH     0x0000000C  ///< High Band
#define ADC_DCCTL7_CIM_M        0x00000003  ///< Comparison Interrupt Mode
#define ADC_DCCTL7_CIM_ALWAYS   0x00000000  ///< Always
#define ADC_DCCTL7_CIM_ONCE     0x00000001  ///< Once
#define ADC_DCCTL7_CIM_HALWAYS  0x00000002  ///< Hysteresis Always
#define ADC_DCCTL7_CIM_HONCE    0x00000003  ///< Hysteresis Once


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP0 register.
 */
#define ADC_DCCMP0_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP0_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP0_COMP1_S      16
#define ADC_DCCMP0_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP1 register.
 */
#define ADC_DCCMP1_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP1_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP1_COMP1_S      16
#define ADC_DCCMP1_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP2 register.
 */
#define ADC_DCCMP2_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP2_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP2_COMP1_S      16
#define ADC_DCCMP2_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP3 register.
 */
#define ADC_DCCMP3_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP3_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP3_COMP1_S      16
#define ADC_DCCMP3_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP4 register.
 */
#define ADC_DCCMP4_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP4_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP4_COMP1_S      16
#define ADC_DCCMP4_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP5 register.
 */
#define ADC_DCCMP5_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP5_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP5_COMP1_S      16
#define ADC_DCCMP5_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP6 register.
 */
#define ADC_DCCMP6_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP6_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP6_COMP1_S      16
#define ADC_DCCMP6_COMP0_S      0


/*
 * The following are defines for the bit fields in the ADC_O_DCCMP7 register.
 */
#define ADC_DCCMP7_COMP1_M      0x03FF0000  ///< Compare 1
#define ADC_DCCMP7_COMP0_M      0x000003FF  ///< Compare 0
#define ADC_DCCMP7_COMP1_S      16
#define ADC_DCCMP7_COMP0_S      0


/*
 * The following are defines for the the interpretation of the data in the
 * SSFIFOx when the ADC TMLB is enabled.
 */

#define ADC_SSFIFO_TMLB_CNT_M   0x000003C0  ///< Continuous Sample Counter
#define ADC_SSFIFO_TMLB_CONT    0x00000020  ///< Continuation Sample Indicator
#define ADC_SSFIFO_TMLB_DIFF    0x00000010  ///< Differential Sample Indicator
#define ADC_SSFIFO_TMLB_TS      0x00000008  ///< Temp Sensor Sample Indicator
#define ADC_SSFIFO_TMLB_MUX_M   0x00000007  ///< Analog Input Indicator
#define ADC_SSFIFO_TMLB_CNT_S   6           ///< Sample counter shift
#define ADC_SSFIFO_TMLB_MUX_S   0           ///< Input channel number shift

#endif /* LM3S_ADC_H */
